Revit 2027 API
HardwoodImperfectionsType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodImperfections" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HardwoodImperfectionsType
Public Enumeration HardwoodImperfectionsType
public enum class HardwoodImperfectionsType
type HardwoodImperfectionsType
Members
Member name | Value | Description
Automatic | 1
Custom | 2
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace